Project/Toir.Adaptation/src/Documents/торо_ЗакрытиеЗаявокИРемонтов/торо_ЗакрытиеЗаявокИРемонтов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>торо_ЗакрытиеЗаявокИРемонтов</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="1956cb75-56b8-44d3-8976-c6da63c7e472">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="4e6ff1a5-fcd3-468d-afb2-4548864e1036">
    <name>ДатаАктуальности</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="e3a25bb8-46cc-47c7-88ab-d8638955a412">
    <name>ППРИнициатор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="42802afd-70ab-4cd7-9b79-5e87db6590e0">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="007823c2-bb3a-4d9b-87d1-b5d3444f3df5">
    <name>ЗакрываемыеРемонты</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="76a060af-30f2-4d31-a1e0-f17789c677b6">
      <name>Перенесен</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="ad8bf9c9-0087-44cc-849d-67c3762f7c6f">
      <name>ID</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>36</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="350c3b6f-c76f-4d49-957e-0ce792d0ed05">
      <name>ОбъектРемонта</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="af553d9d-972c-4298-b6a4-887e960089ef">
      <name>ВидРемонта</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="32713c10-0fa0-41cc-850c-655be40da2d9">
      <name>ДатаНачала</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Date</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="189e7549-3f0c-418a-b4e1-57ef1a2dcf23">
      <name>ДатаОкончания</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Date</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="0160c88d-a1cc-4915-9cef-f895a1ca119d">
      <name>Отменен</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="049f70c2-3f4f-41b2-a503-10a28b152fa7">
      <name>НоваяДатаНачала</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Date</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="23b56d4f-7c04-4bfd-9a20-3ea25aa83315">
      <name>НоваяДатаОкончания</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Date</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="0a8c9a08-a4ae-4fd5-8f1e-f1fb945a37f4">
      <name>ПричинаЗакрытия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="40f5f639-3326-4442-93c7-db72bc8c2b5e">
      <name>ДокументОснование</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="1b6212e2-26ba-4550-804d-6c85664e4b5a">
    <name>ЗакрываемыеЗаявки</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="b37a7dd6-3d54-4079-a8c7-1c03548f8537">
      <name>Заявка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="1afb4107-068f-4994-98dd-e2872c1878ab">
      <name>ПричинаЗакрытия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

Project/Toir.Adaptation/src/InformationRegisters/торо_ЗаявкиПоРемонтам/торо_ЗаявкиПоРемонтам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="1700dbd9-5fec-4508-82e9-7c68a672f6b8">
  <name>торо_ЗаявкиПоРемонтам</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources extendedConfigurationObject="d7dfab1a-d04f-4eef-b624-41857ac954b6">
    <name>ДатаНачалаРемонтныхРабот</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="56b7ecd8-6f82-48c0-a5e4-6b0ed35d9be8">
    <name>ДатаОкончанияРемонтныхРабот</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions extendedConfigurationObject="c0f853e5-15d1-47ec-90ea-b70fc2292634">
    <name>IDРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
  <dimensions extendedConfigurationObject="57cc77f3-0f99-4c18-8855-e9f9bb166844">
    <name>Исполнитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="63334144-1754-4ddf-bae4-01a96dcb2829">
    <name>УточнениеИсполнителя</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir.Adaptation/src/InformationRegisters/торо_АктуальныеПлановыеДатыРемонтов/торо_АктуальныеПлановыеДатыРемонтов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>торо_АктуальныеПлановыеДатыРемонтов</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources>
    <name>ДатаНачала</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>ДатаОкончания</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="87dab202-5f73-4752-a87e-e69c7a5c70e7">
    <name>КрайняяДатаЗавершения</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <attributes>
    <name>ДокументНачалаЦепочки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6ee4238f-830b-4334-9861-1394de9ae423">
    <name>ОбъектРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="a8cd050f-96b8-4025-804f-118eec0e9fd4">
    <name>гкс_ЭтоПереносРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <dimensions>
    <name>IDРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir.Adaptation/src/InformationRegisters/торо_ЗавершенныеРемонтныеРаботы/торо_ЗавершенныеРемонтныеРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>торо_ЗавершенныеРемонтныеРаботы</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <dimensions>
    <name>ID</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
  <dimensions>
    <name>ОбъектРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir.Adaptation/src/InformationRegisters/торо_ОтмененныеРемонты/торо_ОтмененныеРемонты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>торо_ОтмененныеРемонты</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources extendedConfigurationObject="b7320fcb-d548-4601-9a7c-f8afd914b08c">
    <name>Отменен</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions>
    <name>ID</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir.Adaptation/src/InformationRegisters/торо_ВыявленныеДефекты/торо_ВыявленныеДефекты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>торо_ВыявленныеДефекты</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ПодразделениеИсполнитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>КритичностьДефекта</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="fb2fda01-f8af-4657-9434-8cc1e4174283">
    <name>ДатаНачалаРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions>
    <name>ID</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
  <dimensions>
    <name>ОтказавшийЭлемент</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="fdadcdac-c84a-4c5e-9f9d-425c9ce8d7b8">
    <name>ОбъектРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir.Adaptation/src/InformationRegisters/торо_ВнешниеОснованияДляРабот/торо_ВнешниеОснованияДляРабот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>торо_ВнешниеОснованияДляРабот</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions>
    <name>ID</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
  <dimensions>
    <name>ОбъектРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir.Adaptation/src/InformationRegisters/торо_ПлановыеРемонтныеРаботы/торо_ПлановыеРемонтныеРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>торо_ПлановыеРемонтныеРаботы</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Исполнитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>СпособВыполнения</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>Отменен</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>Замещен</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions>
    <name>ВидРемонтныхРабот</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>ID</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
  <dimensions>
    <name>ОбъектРемонтныхРабот</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir.Adaptation/src/Documents/торо_ВнешнееОснованиеДляРабот/торо_ВнешнееОснованиеДляРабот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>торо_ВнешнееОснованиеДляРабот</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>ОбследованноеОборудование</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>ID</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>36</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Исполнитель</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="7c58d82d-a608-4033-a56b-11f5b496d2f1">
      <name>ОбъектРемонта</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="13efe440-7374-4800-b6a4-495744f06814">
      <name>Описание</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

Project/Toir.Adaptation/src/Documents/торо_ЗакрытиеЗаявокИРемонтов/Forms/гкс_ПодборРемонтов/Module.bsl
&НаКлиенте
Процедура ВыбратьРемонт(Команда)
	ТекДанные = Элементы.Список.ТекущиеДанные;
	Если Не ТекДанные = Неопределено Тогда 
		Результат = Новый Структура("ИД,ОР,ВР", ТекДанные.ИД, ТекДанные.ОР, ТекДанные.ВР);
		Результат.Вставить("ДокументОснование", ТекДанные.ДокументОснование);
		Результат.Вставить("Заявка", ТекДанные.Заявка);
		Результат.Вставить("ДатаНачала", ТекДанные.ДатаНачала);
		Результат.Вставить("ДатаОкончания", ТекДанные.ДатаОкончания);
		Оповестить("гкс_ПодборРемонта", Результат);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ВыбратьРемонт(Неопределено);
КонецПроцедуры

&НаСервере
Функция ПолучитьИсходныйТекстЗапроса()
	// гкс+ [07.23] Деснол 21.09.2023
	Возврат "ВЫБРАТЬ РАЗЛИЧНЫЕ
	        |	Заявки.Регистратор КАК Регистратор,
	        |	Заявки.IDРемонта КАК IDРемонта,
	        |	ЕСТЬNULL(Даты.ДатаНачала, Заявки.ДатаНачалаРемонтныхРабот) КАК ДатаНачала,
	        |	ЕСТЬNULL(Даты.ДатаОкончания, Заявки.ДатаОкончанияРемонтныхРабот) КАК ДатаОкончания
	        |ПОМЕСТИТЬ ВТ_ВсеЗаявки_0
	        |ИЗ
	        |	РегистрСведений.торо_ЗаявкиПоРемонтам КАК Заявки
	        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_АктуальныеПлановыеДатыРемонтов КАК Даты
	        |		ПО Заявки.IDРемонта = Даты.IDРемонта
	        |ГДЕ
	        |	ЕСТЬNULL(Даты.ДатаНачала, Заявки.ДатаНачалаРемонтныхРабот) >= &ДатаНачала
	        |	И ЕСТЬNULL(Даты.ДатаНачала, Заявки.ДатаНачалаРемонтныхРабот) < &ДатаОкончания  И &Отбор1
	        |;
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
	        |	Заявки.Регистратор КАК Заявка,
	        |	Заявки.IDРемонта КАК ИД,
	        |	Заявки.ДатаНачала КАК ДатаНачала,
	        |	Заявки.ДатаОкончания КАК ДатаОкончания
	        |ПОМЕСТИТЬ ВТ_ВсеЗаявки
	        |ИЗ
	        |	ВТ_ВсеЗаявки_0 КАК Заявки
	        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_ЗавершенныеРемонтныеРаботы.СрезПоследних(, ID В (выбрать ТЧ.IDРемонта ИЗ ВТ_ВсеЗаявки_0 КАК ТЧ)) КАК Завершенные
	        |		ПО Заявки.IDРемонта = Завершенные.ID
	        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_ОтмененныеРемонты.СрезПоследних(, ID В (выбрать ТЧ.IDРемонта ИЗ ВТ_ВсеЗаявки_0 КАК ТЧ)) КАК Отмененные
	        |		ПО Заявки.IDРемонта = Отмененные.ID
	        |ГДЕ
	        |	Завершенные.ID ЕСТЬ NULL
	        |	И Отмененные.Регистратор ЕСТЬ NULL
			|;
			|УНИЧТОЖИТЬ ВТ_ВсеЗаявки_0
	        |;
			|ВЫБРАТЬ
	        |	ВТ_ВсеЗаявки.Заявка КАК Заявка,
	        |	ВТ_ВсеЗаявки.ИД КАК ИД,
	        |	ВТ_ВсеЗаявки.ДатаНачала КАК ДатаНачала,
	        |	ВТ_ВсеЗаявки.ДатаОкончания КАК ДатаОкончания,
	        |	Дефекты.Регистратор КАК ДокументОснование,
	        |	Дефекты.ОбъектРемонта КАК ОР
			|Поместить ВТ_ИзДефектов
	        |ИЗ
	        |	ВТ_ВсеЗаявки КАК ВТ_ВсеЗаявки
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_ВыявленныеДефекты.СрезПоследних(, ID В (выбрать ТЧ.ИД ИЗ ВТ_ВсеЗаявки КАК ТЧ)) КАК Дефекты
	        |		ПО ВТ_ВсеЗаявки.ИД = Дефекты.ID
			|;
			|ВЫБРАТЬ
	        |	ВТ_ВсеЗаявки.Заявка КАК Заявка,
	        |	ВТ_ВсеЗаявки.ИД КАК ИД,
	        |	ВТ_ВсеЗаявки.ДатаНачала КАК ДатаНачала,
	        |	ВТ_ВсеЗаявки.ДатаОкончания КАК ДатаОкончания,
	        |	Внешнее.Регистратор КАК ДокументОснование,
	        |	Внешнее.ОбъектРемонта КАК ОР
			|Поместить ВТ_ИзВО
	        |ИЗ
	        |	ВТ_ВсеЗаявки КАК ВТ_ВсеЗаявки
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_ВнешниеОснованияДляРабот.СрезПоследних(, Регистратор ССЫЛКА Документ.торо_ВнешнееОснованиеДляРабот
			|И ID В (выбрать ТЧ.ИД ИЗ ВТ_ВсеЗаявки КАК ТЧ)) КАК Внешнее
	        |		ПО ВТ_ВсеЗаявки.ИД = Внешнее.ID
			|;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВТ_ВсеЗаявки.Заявка КАК Заявка,
	        |	ВТ_ВсеЗаявки.ИД КАК ИД,
	        |	ВТ_ВсеЗаявки.ДатаНачала КАК ДатаНачала,
	        |	ВТ_ВсеЗаявки.ДатаОкончания КАК ДатаОкончания,
	        |	ВТ_ВсеЗаявки.ДокументОснование КАК ДокументОснование,
	        |	ВТ_ВсеЗаявки.ОР КАК ОР,
	        |	ДокТЧ.ВидРемонтныхРабот КАК ВР
	        |ИЗ
	        |	ВТ_ИзДефектов КАК ВТ_ВсеЗаявки
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_ЗаявкаНаРемонт.РемонтыОборудования КАК ДокТЧ
	        |		ПО ВТ_ВсеЗаявки.Заявка = ДокТЧ.Ссылка
	        |			И ВТ_ВсеЗаявки.ИД = ДокТЧ.ID
	        |
	        |ОБЪЕДИНИТЬ ВСЕ
	        |
	        |ВЫБРАТЬ
	        |	ВТ_ВсеЗаявки.Заявка,
	        |	ВТ_ВсеЗаявки.ИД,
	        |	ВТ_ВсеЗаявки.ДатаНачала,
	        |	ВТ_ВсеЗаявки.ДатаОкончания,
	        |	ППР.Регистратор,
	        |	ППР.ОбъектРемонтныхРабот,
	        |	ППР.ВидРемонтныхРабот
	        |ИЗ
	        |	ВТ_ВсеЗаявки КАК ВТ_ВсеЗаявки
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_ПлановыеРемонтныеРаботы.СрезПоследних(, Регистратор ССЫЛКА Документ.торо_ПланГрафикРемонта
			|И ID В (выбрать ТЧ.ИД ИЗ ВТ_ВсеЗаявки КАК ТЧ)) КАК ППР
	        |		ПО ВТ_ВсеЗаявки.ИД = ППР.ID
	        |
	        |ОБЪЕДИНИТЬ ВСЕ
	        |
	        |ВЫБРАТЬ
	        |	ВТ_ВсеЗаявки.Заявка,
	        |	ВТ_ВсеЗаявки.ИД,
	        |	ВТ_ВсеЗаявки.ДатаНачала,
	        |	ВТ_ВсеЗаявки.ДатаОкончания,
	        |	ВТ_ВсеЗаявки.ДокументОснование,
	        |	ВТ_ВсеЗаявки.ОР,
	        |	ДокТЧ.ВидРемонтныхРабот
	        |ИЗ
	        |	ВТ_ИзВО КАК ВТ_ВсеЗаявки
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_ЗаявкаНаРемонт.РемонтыОборудования КАК ДокТЧ
	        |		ПО ВТ_ВсеЗаявки.Заявка = ДокТЧ.Ссылка
	        |			И ВТ_ВсеЗаявки.ИД = ДокТЧ.ID";
	// гкс- [07.23] Деснол 21.09.2023
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПериодРемонта.ДатаНачала = НачалоМесяца(ТекущаяДата());
	ПериодРемонта.ДатаОкончания = КонецМесяца(ПериодРемонта.ДатаНачала);
	Список.ТекстЗапроса = ПолучитьИсходныйТекстЗапроса();
	Если ф_ОстановочныйИсп Тогда 
		Если р_Остановочный Тогда 
			Список.ТекстЗапроса = СтрЗаменить(Список.ТекстЗапроса, "И &Отбор1", "Заявки.Регистратор.гкс_НуженОстанов И &Отбор1");
		Иначе
			Список.ТекстЗапроса = СтрЗаменить(Список.ТекстЗапроса, "И &Отбор1", "Не Заявки.Регистратор.гкс_НуженОстанов И &Отбор1");
		КонецЕсли;
	КонецЕсли;
	Если ф_ОтвИсп Тогда 
		Список.ТекстЗапроса = СтрЗаменить(Список.ТекстЗапроса, "И &Отбор1", "Заявки.Регистратор.Ответственный В (&Ответственный) И &Отбор1");
		Список.Параметры.УстановитьЗначениеПараметра("Ответственный", р_Ответственный);
	КонецЕсли;
	Если ф_ПодрИсп Тогда 
		Список.ТекстЗапроса = СтрЗаменить(Список.ТекстЗапроса, "И &Отбор1", "Заявки.Регистратор.Подразделение В (&Подразделение) И &Отбор1");
		Список.Параметры.УстановитьЗначениеПараметра("Подразделение", р_Подразделение);
	КонецЕсли;
	Если ф_СпособИсп Тогда 
		Список.ТекстЗапроса = СтрЗаменить(Список.ТекстЗапроса, "И &Отбор1", "Заявки.Регистратор.СпособСогласования В (&Способ) И &Отбор1");
		Список.Параметры.УстановитьЗначениеПараметра("Способ", СпособСогласования);
	КонецЕсли;
	Если ф_ИспИсп Тогда 
		Список.ТекстЗапроса = СтрЗаменить(Список.ТекстЗапроса, "И &Отбор1", "Заявки.Исполнитель В (&Исполнитель) И &Отбор1");
		Список.Параметры.УстановитьЗначениеПараметра("Исполнитель", р_Исполнитель);
	КонецЕсли;
	Список.Параметры.УстановитьЗначениеПараметра("ДатаНачала", ПериодРемонта.ДатаНачала);
	Список.Параметры.УстановитьЗначениеПараметра("ДатаОкончания", ПериодРемонта.ДатаОкончания);
	
	Список.ТекстЗапроса = СтрЗаменить(Список.ТекстЗапроса, "И &Отбор1", "");
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОтборыВСписке()
	
	Список.Параметры.УстановитьЗначениеПараметра("ДатаНачала", ПериодРемонта.ДатаНачала);
	Список.Параметры.УстановитьЗначениеПараметра("ДатаОкончания", ПериодРемонта.ДатаОкончания);
КонецПроцедуры

&НаКлиенте
Процедура ПериодРемонтаПриИзменении(Элемент)
	Список.Параметры.УстановитьЗначениеПараметра("ДатаНачала", ПериодРемонта.ДатаНачала);
	Список.Параметры.УстановитьЗначениеПараметра("ДатаОкончания", ПериодРемонта.ДатаОкончания);
КонецПроцедуры

&НаКлиенте
Процедура р_ОтветственныйПриИзменении(Элемент)
	ОбновитьОтборыНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбновитьОтборыНаСервере()
	Список.ТекстЗапроса = ПолучитьИсходныйТекстЗапроса();
	Если ф_ОстановочныйИсп Тогда 
		Если р_Остановочный Тогда 
			Список.ТекстЗапроса = СтрЗаменить(Список.ТекстЗапроса, "И &Отбор1", "И Заявки.Регистратор.гкс_НуженОстанов = ""Да"" И &Отбор1");
		Иначе
			Список.ТекстЗапроса = СтрЗаменить(Список.ТекстЗапроса, "И &Отбор1", "И Заявки.Регистратор.гкс_НуженОстанов = ""Нет"" И &Отбор1");
		КонецЕсли;
	КонецЕсли;
	Если ф_ОтвИсп Тогда 
		Список.ТекстЗапроса = СтрЗаменить(Список.ТекстЗапроса, "И &Отбор1", "И Заявки.Регистратор.Ответственный В (&Ответственный) И &Отбор1");
		Список.Параметры.УстановитьЗначениеПараметра("Ответственный", р_Ответственный);
	КонецЕсли;
	Если ф_ПодрИсп Тогда 
		Список.ТекстЗапроса = СтрЗаменить(Список.ТекстЗапроса, "И &Отбор1", "И Заявки.Регистратор.Подразделение В (&Подразделение) И &Отбор1");
		Список.Параметры.УстановитьЗначениеПараметра("Подразделение", р_Подразделение);
	КонецЕсли;
	Если ф_СпособИсп Тогда 
		Список.ТекстЗапроса = СтрЗаменить(Список.ТекстЗапроса, "И &Отбор1", "И Заявки.Регистратор.СпособСогласования В (&Способ) И &Отбор1");
		Список.Параметры.УстановитьЗначениеПараметра("Способ", СпособСогласования);
	КонецЕсли;
	Если ф_ИспИсп Тогда 
		Список.ТекстЗапроса = СтрЗаменить(Список.ТекстЗапроса, "И &Отбор1", "И Заявки.Исполнитель В (&Исполнитель) И &Отбор1");
		Список.Параметры.УстановитьЗначениеПараметра("Исполнитель", р_Исполнитель);
	КонецЕсли;
	Список.Параметры.УстановитьЗначениеПараметра("ДатаНачала", ПериодРемонта.ДатаНачала);
	Список.Параметры.УстановитьЗначениеПараметра("ДатаОкончания", ПериодРемонта.ДатаОкончания);
	
	Список.ТекстЗапроса = СтрЗаменить(Список.ТекстЗапроса, "И &Отбор1", "");
КонецПроцедуры
